projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ТарифныеСеткиОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСеткиОбеспечения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикиСуммЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпецЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ЦенообразованиеСетка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦенообразованиеСетка</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПринципалыУстановкиЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУслугОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикиСуммЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпецЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ТипыУслугОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУслугОрганизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодыCMR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеТД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ТипыДополнительныхАналитикЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДополнительныхАналитикЦенообразования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистративныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТаможенныхПунктов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ВидыРасчетаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРасчетаЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ДополнительныеАналитикиЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДополнительныеАналитикиЦенообразования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлючиАналитикЦенообразования</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеОкруги</v8:Type>
						<v8:Type>cfg:CatalogRef.СтранаОформления</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировкиВКлючеАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/АналитикиСуммЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>АналитикиСуммЦенообразования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлючиАналитикЦенообразования</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеАналитики</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировкиВКлючеАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ГруппыСтран.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыСтран</Name>
			<Comment>Вспомогательный справочник для оптимизации алгоритмов заполнения цен</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоставГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтраныГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтранаОформления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ТарифныеСеткиОбеспечения/Ext/ManagerModule.bsl
Функция ТабличныйДокументЦенВывод(СтруктураПараметров, ТолькоСетка=Ложь, КодЯзыка="ru", ТекстЗаголовка="", ДатаЦен=Неопределено, РежимРедактированияЦен=Ложь, ВалютаСетки=Неопределено, ДляОтчетаПоЦенамКонтрагента=Ложь) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;

	Макет = РегистрыСведений.ТарифныеСеткиОбеспечения.ПолучитьМакет("МакетСеткиЦен");
	
	пКонтрагент				= СтруктураПараметров.Контрагент;
	ТипУслуги				= СтруктураПараметров.ТипУслуги;
	Если ТипУслуги = 0 Тогда
		пУслуга = Перечисления.ТипыУслугОрганизации.ОсновнаяУслуга;
	ИначеЕсли ТипУслуги = 1 Тогда
		пУслуга = Перечисления.ТипыУслугОрганизации.Код;
	КонецЕсли;
	
	пДатаЦен 				= Неопределено;
	ВалютаСетки 			= Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТарифныеСеткиОбеспеченияСрезПоследних.Период КАК Период,
	|	ТарифныеСеткиОбеспеченияСрезПоследних.Валюта КАК Валюта,
	|	ТарифныеСеткиОбеспеченияСрезПоследних.КлючАналитик КАК КлючАналитик
	|ИЗ
	|	РегистрСведений.ТарифныеСеткиОбеспечения.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ТарифныеСеткиОбеспеченияСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата"						, ДатаЦен);
	Запрос.УстановитьПараметр("Контрагент"					, пКонтрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		пДатаЦен 				= Выборка.Период;
		пКлюч 					= Выборка.КлючАналитик;
		ВалютаСетки				= Выборка.Валюта;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДатаЦен", пДатаЦен);
	ПолучитьСтруктуруКлюча(пКлюч, СтруктураПараметров);
	
	пТекстВалюта = "";
	Если ЗначениеЗаполнено(ВалютаСетки) Тогда
		пТекстВалюта = ?(ЗначениеЗаполнено(ВалютаСетки.Наименование), СокрЛП(ВалютаСетки.Наименование), СокрЛП(ВалютаСетки));
	КонецЕсли;
	
	Если ТекстЗаголовка = "" Тогда
		Если ТолькоСетка Тогда
			пТекстЗаголовка = НСтр("ru='Сетка: '", КодЯзыка) + СокрЛП(пКлюч);
		Иначе

			пТекстЗаголовка = НСтр("ru='Цены контрагента: '", КодЯзыка) + СокрЛП(пКонтрагент.НаименованиеПолное) + Символы.ПС 
				+ НСтр("ru='Услуга: '", КодЯзыка) + СокрЛП(пУслуга)
				+ ?(пДатаЦен = Неопределено, "", ?(КодЯзыка = "en", " (" + Формат(пДатаЦен, "Л=en; ДФ=dd/MM/yyyy") + ")", НСтр("ru=' (от '", КодЯзыка) + Формат(пДатаЦен, "ДФ=dd.MM.yyyy") + НСтр("ru=' г.'", КодЯзыка) + ")"))
				+ ?(ЗначениеЗаполнено(пТекстВалюта), НСтр("ru=' (в '", КодЯзыка) + СокрЛП(пТекстВалюта) + ")", "")

		КонецЕсли;                                  
	Иначе
		Если (НЕ ТолькоСетка) И ЗначениеЗаполнено(пТекстВалюта) Тогда
			пТекстЗаголовка = ТекстЗаголовка + НСтр("ru=' (в '", КодЯзыка) + СокрЛП(пТекстВалюта) + ")";
		Иначе
			пТекстЗаголовка = ТекстЗаголовка;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураПараметров.СубконтоСпецЦены) тогда
		пТекстЗаголовка = пТекстЗаголовка + " " + ".Пункт отправления: "+СокрЛП(СтруктураПараметров.СубконтоСпецЦены); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(пТекстЗаголовка) Тогда
		ОблЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		ОблЗаголовок.Параметры.ТекстЗаголовка = пТекстЗаголовка;
		ТабДок.Вывести(ОблЗаголовок);
	Иначе
		ОблЗаголовок = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
		ТабДок.Вывести(ОблЗаголовок);
	КонецЕсли;
	
	Если СтруктураПараметров.МассивАналитик.Количество() = 0 Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Если НЕ ТолькоСетка Тогда
		пДанныеКлюча = ПолучитьДанныеДляТаблицыКлюча(пКлюч, СтруктураПараметров);
	КонецЕсли;
	
	Если пКлюч.ИспользоватьДополнительнуюАналитику И пКлюч.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние  Тогда
		пПостфикс = НСтр("ru=' км';en=' km'", КодЯзыка);
	Иначе
		пПостфикс = "";
	КонецЕсли;
	
	СписокАналитик = Новый СписокЗначений;
	Для каждого Эл Из СтруктураПараметров.МассивАналитик Цикл
		СписокАналитик.Добавить(Эл, Строка(Эл.ЗначениеАналитики));
	КонецЦикла;
	
	СписокДопАналитик = Новый СписокЗначений;
	Если пКлюч.ИспользоватьДополнительнуюАналитику Тогда
		Для каждого Эл Из СтруктураПараметров.МассивДопАналитик Цикл
			СписокДопАналитик.Добавить(Эл, Строка(Эл.ЗначениеАналитики));
		КонецЦикла;
	Иначе
		СписокДопАналитик.Добавить(Справочники.ДополнительныеАналитикиЦенообразования.ПустаяСсылка(), НСтр("ru='Цена';en='ETD'", КодЯзыка));
	КонецЕсли;
	
	// вывод
	ОблШапкаАналитика = Макет.ПолучитьОбласть("ШапкаАналитика");
	ОблШапкаАналитика.Параметры.Аналитика = НСтр("ru='Сумма обеспечения';en='Customs payments'", КодЯзыка);
	ТабДок.Вывести(ОблШапкаАналитика);
	
	Если ТолькоСетка ИЛИ РежимРедактированияЦен Тогда
		ОблШапкаДопАналитика = Макет.ПолучитьОбласть("ШапкаДопАналитика");
	Иначе
		ОблШапкаДопАналитика = Макет.ПолучитьОбласть("ШапкаДопАналитикаВывод");
	КонецЕсли;
	
	Для каждого ЭлСп Из СписокДопАналитик Цикл
		ОблШапкаДопАналитика.Параметры.ДопАналитика = ЭлСп.Представление + пПостфикс;
		ТабДок.Присоединить(ОблШапкаДопАналитика);
	КонецЦикла;
	
	ОблШапкаКонец = Макет.ПолучитьОбласть("ШапкаКонец");
	ТабДок.Присоединить(ОблШапкаКонец);
	
	Для каждого ЭлСпА Из СписокАналитик Цикл
		
		Если ТолькоСетка ИЛИ РежимРедактированияЦен Тогда
			//ОблСтрокаДопАналитикаИР = Макет.ПолучитьОбласть("СтрокаДопАналитикаИндивидуальныйРасчет");
			//ОблСтрокаДопАналитикаЗН = Макет.ПолучитьОбласть("СтрокаДопАналитикаЗначение");
			//ОблСтрокаДопАналитикаВР = Макет.ПолучитьОбласть("СтрокаДопАналитикаВидРасчета");
			
			ОблСтрокаАналитика = Макет.ПолучитьОбласть("СтрокаАналитикаМЦ");
			ОблСтрокаДопАналитика = Макет.ПолучитьОбласть("СтрокаДопАналитикаМЦ");
			//ОблСтрокаДопАналитикаИР = ОблСтрокаДопАналитика.ПолучитьОбласть("СтрокаДопАналитикаИндивидуальныйРасчетМЦ");
			//ОблСтрокаДопАналитикаЗН = ОблСтрокаДопАналитика.ПолучитьОбласть("СтрокаДопАналитикаЗначениеМЦ");
			//ОблСтрокаДопАналитикаВР = ОблСтрокаДопАналитика.ПолучитьОбласть("СтрокаДопАналитикаВидРасчетаМЦ");
			//ОблСтрокаДопАналитикаМЦ = ОблСтрокаДопАналитика.ПолучитьОбласть("СтрокаДопАналаитикаМинимальнаяЦенаМЦ");
			//////ОблСтрокаДопАналитикаИР = ОблСтрокаДопАналитика.Область(2,4,2,4);
			//////ОблСтрокаДопАналитикаЗН = ОблСтрокаДопАналитика.Область(1,1,1,3);
			//////ОблСтрокаДопАналитикаВР = ОблСтрокаДопАналитика.Область(1,4,1,4);
			//////ОблСтрокаДопАналитикаМЦ = ОблСтрокаДопАналитика.Область(2,1,2,3);
		Иначе
			ОблСтрокаАналитика = Макет.ПолучитьОбласть("СтрокаАналитика");
			ОблСтрокаДопАналитика = Макет.ПолучитьОбласть("СтрокаДопАналитикаВывод");
		КонецЕсли;
		
		ОблСтрокаАналитика.Параметры.Аналитика = ЭлСпА.Представление;
		ТабДок.Вывести(ОблСтрокаАналитика);
		
		Для каждого ЭлСпДА Из СписокДопАналитик Цикл
			пИндивидуальныйРасчет 	= "";
			пЗначениеДопАналитики 	= 0;
			пЗначениеМинЦены 		= 0;
			пЗначениеВидРасчетаЦен 	= "";
			Если НЕ ТолькоСетка Тогда
				МасСтрДА = пДанныеКлюча.НайтиСтроки(Новый Структура("АналитикаСумм,ДопАналитика", ЭлСпА.Значение, ЭлСпДА.Значение));
				Если РежимРедактированияЦен Тогда
					Если МасСтрДА.Количество() > 0 Тогда
						СтрДА = МасСтрДА[0];
						
						Если СтрДА.ИндивидуальныйРасчет Тогда
							пИндивидуальныйРасчет 	= "ИР";
							пЗначениеДопАналитики 	= 0;
							пЗначениеМинЦены 		= 0;
							пЗначениеВидРасчетаЦен 	= "";
						Иначе
							пИндивидуальныйРасчет 	= "";
							пЗначениеДопАналитики 	= Формат(СтрДА.Цена, ?(СтрДА.ВидРасчета = Перечисления.ВидыРасчетаЦен.Процент, "ЧДЦ=3", "ЧДЦ=2"));
							пЗначениеМинЦены 		= Формат(СтрДА.МинимальнаяЦена, "ЧДЦ=2");
							пЗначениеВидРасчетаЦен 	= ?(СтрДА.ВидРасчета = Перечисления.ВидыРасчетаЦен.Процент, "%", "");
						КонецЕсли;
					КонецЕсли;
					
					ОблСтрокаДопАналитика.Параметры.ИР_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина);
					ОблСтрокаДопАналитика.Параметры.ИндивидуальныйРасчет 	= пИндивидуальныйРасчет;
					//ОблДАИР = ТабДок.Присоединить(ОблСтрокаДопАналитикаИР);
					
					Если пЗначениеВидРасчетаЦен = "%" Тогда
						ОблСтрокаДопАналитика.Область(1,1,1,3).Формат 				= "ЧДЦ=3";
						ОблСтрокаДопАналитика.Область(1,1,1,3).ФорматРедактирования = "ЧДЦ=3";
					Иначе //Если пЗначениеВидРасчетаЦен = "" Тогда
						ОблСтрокаДопАналитика.Область(1,1,1,3).Формат 				= "ЧДЦ=2";
						ОблСтрокаДопАналитика.Область(1,1,1,3).ФорматРедактирования = "ЧДЦ=2";
					КонецЕсли;
					
					ОблСтрокаДопАналитика.Параметры.ЗН_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоЗначение,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, пИндивидуальныйРасчет);
					ОблСтрокаДопАналитика.Параметры.ДопАналитика 	= пЗначениеДопАналитики;
					//ОблДАЗН = ТабДок.Присоединить(ОблСтрокаДопАналитикаЗН);
					
					ОблСтрокаДопАналитика.Параметры.ВР_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоВидРасчета,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, пИндивидуальныйРасчет);
					ОблСтрокаДопАналитика.Параметры.ВидРасчета 	= пЗначениеВидРасчетаЦен;
					//ОблДАВР = ТабДок.Присоединить(ОблСтрокаДопАналитикаВР);
					
					ОблСтрокаДопАналитика.Параметры.МЦ_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоМинимальнаяЦена,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, пИндивидуальныйРасчет);
					ОблСтрокаДопАналитика.Параметры.ДопАналитикаМЦ = пЗначениеМинЦены;
					
					ОблДА = ТабДок.Присоединить(ОблСтрокаДопАналитика);
				Иначе
					Если МасСтрДА.Количество() > 0 Тогда
						СтрДА = МасСтрДА[0];
						
						Если СтрДА.ИндивидуальныйРасчет Тогда
							пЗначениеДопАналитики 	= "ИР";
						Иначе
							//пЗначениеДопАналитики = Строка(СтрДА.Цена) + ?(СтрДА.ВидРасчета = Перечисления.ВидыРасчетаЦен.Процент, " %", "");
							пЗначениеДопАналитики = Строка(СтрДА.Цена) + ?(СтрДА.ВидРасчета = Перечисления.ВидыРасчетаЦен.Процент, " %", "")
													+ ?(ЗначениеЗаполнено(СтрДА.МинимальнаяЦена), Символы.ПС + " (>" + Строка(СтрДА.МинимальнаяЦена) + ")", "");
						КонецЕсли;
						
					КонецЕсли;
					ОблСтрокаДопАналитика.Параметры.ДопАналитика 			= пЗначениеДопАналитики;
					ТабДок.Присоединить(ОблСтрокаДопАналитика);
				КонецЕсли;
			Иначе
				
				ОблСтрокаДопАналитика.Параметры.ИР_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина);
				//ОблДАИР = ТабДок.Присоединить(ОблСтрокаДопАналитикаИР);
				
				ОблСтрокаДопАналитика.Параметры.ЗН_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоЗначение,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, "");
				//ОблДАЗН = ТабДок.Присоединить(ОблСтрокаДопАналитикаЗН);
				
				ОблСтрокаДопАналитика.Параметры.ВР_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоВидРасчета,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, "");
				//ОблДАВР = ТабДок.Присоединить(ОблСтрокаДопАналитикаВР);
				
				ОблСтрокаДопАналитика.Параметры.МЦ_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоМинимальнаяЦена,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, "");
				
				ОблДА = ТабДок.Присоединить(ОблСтрокаДопАналитика);
				
				//ОблСтрокаДопАналитика.Параметры.СтруктураРасшифровки 	= СтруктураРасшифровки;
				//ТабДок.Присоединить(ОблСтрокаДопАналитика);
			КонецЕсли;
		КонецЦикла;
		
		Если ТолькоСетка ИЛИ РежимРедактированияЦен Тогда
			ОблСтрокаКонец = Макет.ПолучитьОбласть("СтрокаКонецМЦ");
		Иначе
			ОблСтрокаКонец = Макет.ПолучитьОбласть("СтрокаКонец");
		КонецЕсли;
		
		ТабДок.Присоединить(ОблСтрокаКонец);
		
	КонецЦикла;
	
	ОблПодвалАналитика = Макет.ПолучитьОбласть("ПодвалАналитика");
	ТабДок.Вывести(ОблПодвалАналитика);
	
	Если ТолькоСетка ИЛИ РежимРедактированияЦен Тогда
		ОблПодвалДопАналитика = Макет.ПолучитьОбласть("ПодвалДопАналитика");
	Иначе
		ОблПодвалДопАналитика = Макет.ПолучитьОбласть("ПодвалДопАналитикаВывод");
	КонецЕсли;
	
	Для каждого ЭлСп Из СписокДопАналитик Цикл
		ТабДок.Присоединить(ОблПодвалДопАналитика);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.ТолькоПросмотр 	= Истина;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьДанныеДляТаблицыКлюча(пКлюч, СтруктураПараметров)
	
	пКонтрагент = СтруктураПараметров.Контрагент;
	пДатаЦен 	= КонецДня(СтруктураПараметров.ДатаЦен);
	пСпецЦены	= (СтруктураПараметров.Свойство("СпецЦены") И СтруктураПараметров.СпецЦены);
	пСубконтоСпецЦены = СтруктураПараметров.СубконтоСпецЦены;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦенообразованиеСеткаСрезПоследних.АналитикаСумм КАК АналитикаСумм,
	|	ЦенообразованиеСеткаСрезПоследних.ДополнительнаяАналитика КАК ДопАналитика,
	|	ЦенообразованиеСеткаСрезПоследних.Цена КАК Цена,
	|	ЦенообразованиеСеткаСрезПоследних.Контрагент КАК Контрагент,
	|	ЦенообразованиеСеткаСрезПоследних.КлючАналитик КАК КлючАналитик,
	|	ЦенообразованиеСеткаСрезПоследних.ИндивидуальныйРасчет КАК ИндивидуальныйРасчет,
	|	ЦенообразованиеСеткаСрезПоследних.ВидРасчета КАК ВидРасчета,
	|	ЦенообразованиеСеткаСрезПоследних.Валюта КАК Валюта,
	|	ЦенообразованиеСеткаСрезПоследних.МинимальнаяЦена КАК МинимальнаяЦена
	|ИЗ
	|	РегистрСведений.ТарифныеСеткиОбеспечения.СрезПоследних(
	|			&Дата,
	|			Контрагент = &Контрагент
	|				И КлючАналитик = &КлючАналитик
	|				И СпецЦены = &СпецЦены
	|				И СубконтоСпецЦены = &СубконтоСпецЦены) КАК ЦенообразованиеСеткаСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦенообразованиеСеткаСрезПоследних.АналитикаСумм.ЗначениеАналитики,
	|	ЦенообразованиеСеткаСрезПоследних.АналитикаСумм.ПорядокСортировкиВКлючеАналитик,
	|	ЦенообразованиеСеткаСрезПоследних.ДополнительнаяАналитика.ПорядокСортировкиВКлючеАналитик,
	|	ЦенообразованиеСеткаСрезПоследних.ДополнительнаяАналитика.ЗначениеАналитики";
	
	Запрос.УстановитьПараметр("Дата"				, пДатаЦен);
	Запрос.УстановитьПараметр("КлючАналитик"		, пКлюч);
	Запрос.УстановитьПараметр("Контрагент"			, пКонтрагент); 
	Запрос.УстановитьПараметр("СпецЦены"			, пСпецЦены);
	Запрос.УстановитьПараметр("СубконтоСпецЦены"	, пСубконтоСпецЦены);

	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПолучитьСтруктуруКлюча(пКлюч, СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикиСуммЦенообразования.Ссылка КАК АналитикаСумм
	|ИЗ
	|	Справочник.АналитикиСуммЦенообразования КАК АналитикиСуммЦенообразования
	|ГДЕ
	|	АналитикиСуммЦенообразования.Владелец = &Ключ
	|	И НЕ АналитикиСуммЦенообразования.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	АналитикиСуммЦенообразования.ЗначениеАналитики,
	|	АналитикиСуммЦенообразования.ПорядокСортировкиВКлючеАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеАналитикиЦенообразования.Ссылка КАК ДопАналитика
	|ИЗ
	|	Справочник.ДополнительныеАналитикиЦенообразования КАК ДополнительныеАналитикиЦенообразования
	|ГДЕ
	|	ДополнительныеАналитикиЦенообразования.Владелец = &Ключ
	|	И НЕ ДополнительныеАналитикиЦенообразования.ПометкаУдаления
	|	И ДополнительныеАналитикиЦенообразования.Владелец.ИспользоватьДополнительнуюАналитику
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДополнительныеАналитикиЦенообразования.ПорядокСортировкиВКлючеАналитик,
	|	ДополнительныеАналитикиЦенообразования.ЗначениеАналитики";
	
	Запрос.УстановитьПараметр("Ключ", пКлюч);
	
	МасРезультат = Запрос.ВыполнитьПакет();
	
	СтруктураПараметров.Вставить("МассивАналитик"	, МасРезультат[0].Выгрузить().ВыгрузитьКолонку("АналитикаСумм"));
	СтруктураПараметров.Вставить("МассивДопАналитик", МасРезультат[1].Выгрузить().ВыгрузитьКолонку("ДопАналитика"));
	
КонецПроцедуры

// Сетка
Функция ТабличныйДокументЦенСетка(СтруктураПараметров, КодЯзыка="ru", ТекстЗаголовка="", РежимРедактированияЦен=Ложь) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	//ТабДок.КлючПараметровПечати 	= "ПечатьСеткаКлюча_2019";
	
	Макет = РегистрыСведений.ТарифныеСеткиОбеспечения.ПолучитьМакет("МакетСеткиЦен");
	
	пКлюч 	= СтруктураПараметров.КлючАналитик;
	
	ПолучитьСтруктуруКлюча(пКлюч, СтруктураПараметров);
	
	Если ТекстЗаголовка = "" Тогда
		пТекстЗаголовка = НСтр("ru='Сетка:'", КодЯзыка) + СокрЛП(пКлюч);
	Иначе
		пТекстЗаголовка = ТекстЗаголовка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(пТекстЗаголовка) Тогда
		ОблЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		ОблЗаголовок.Параметры.ТекстЗаголовка = пТекстЗаголовка;
		ТабДок.Вывести(ОблЗаголовок);
	Иначе
		ОблЗаголовок = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
		ТабДок.Вывести(ОблЗаголовок);
	КонецЕсли;
	
	Если СтруктураПараметров.МассивАналитик.Количество() = 0 Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Если пКлюч.ИспользоватьДополнительнуюАналитику И пКлюч.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние  Тогда
		пПостфикс = " км";
	Иначе
		пПостфикс = "";
	КонецЕсли;
	
	СписокАналитик = Новый СписокЗначений;
	Для каждого Эл Из СтруктураПараметров.МассивАналитик Цикл
		СписокАналитик.Добавить(Эл, Строка(Эл.ЗначениеАналитики));
	КонецЦикла;
	
	СписокДопАналитик = Новый СписокЗначений;
	Если пКлюч.ИспользоватьДополнительнуюАналитику Тогда
		Для каждого Эл Из СтруктураПараметров.МассивДопАналитик Цикл
			СписокДопАналитик.Добавить(Эл, Строка(Эл.ЗначениеАналитики));
		КонецЦикла;
	Иначе
		СписокДопАналитик.Добавить(Справочники.ДополнительныеАналитикиЦенообразования.ПустаяСсылка(), НСтр("ru='Цена'", КодЯзыка));
	КонецЕсли;
	
	// вывод
	ОблШапкаАналитика = Макет.ПолучитьОбласть("ШапкаАналитика");
	ОблШапкаАналитика.Параметры.Аналитика = НСтр("ru='Сумма обеспечения'", КодЯзыка);
	ТабДок.Вывести(ОблШапкаАналитика);
	
	Если РежимРедактированияЦен Тогда
		ОблШапкаДопАналитика = Макет.ПолучитьОбласть("ШапкаДопАналитика");
	Иначе
		ОблШапкаДопАналитика = Макет.ПолучитьОбласть("ШапкаДопАналитикаВывод");
	КонецЕсли;
	
	Для каждого ЭлСп Из СписокДопАналитик Цикл
		ОблШапкаДопАналитика.Параметры.ДопАналитика = ЭлСп.Представление + пПостфикс;
		ТабДок.Присоединить(ОблШапкаДопАналитика);
	КонецЦикла;
	
	ОблШапкаКонец = Макет.ПолучитьОбласть("ШапкаКонец");
	ТабДок.Присоединить(ОблШапкаКонец);
	
	пЗначениеДопАналитики = 0;
	Для каждого ЭлСпА Из СписокАналитик Цикл
		
		Если РежимРедактированияЦен Тогда
			ОблСтрокаАналитика		= Макет.ПолучитьОбласть("СтрокаАналитикаМЦ");
			ОблСтрокаДопАналитика 	= Макет.ПолучитьОбласть("СтрокаДопАналитикаМЦ");
			//ОблСтрокаДопАналитикаИР = Макет.ПолучитьОбласть("СтрокаДопАналитикаИндивидуальныйРасчет");
			//ОблСтрокаДопАналитикаЗН = Макет.ПолучитьОбласть("СтрокаДопАналитикаЗначение");
			//ОблСтрокаДопАналитикаВР = Макет.ПолучитьОбласть("СтрокаДопАналитикаВидРасчета");
		Иначе
			ОблСтрокаАналитика 		= Макет.ПолучитьОбласть("СтрокаАналитика");
			ОблСтрокаДопАналитика 	= Макет.ПолучитьОбласть("СтрокаДопАналитикаВывод");
		КонецЕсли;
		
		//ОблСтрокаАналитика = Макет.ПолучитьОбласть("СтрокаАналитика");
		ОблСтрокаАналитика.Параметры.Аналитика = ЭлСпА.Представление;
		ТабДок.Вывести(ОблСтрокаАналитика);
		
		Для каждого ЭлСпДА Из СписокДопАналитик Цикл
			
			Если РежимРедактированияЦен Тогда
				ОблСтрокаДопАналитика.Параметры.ИР_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина);
				//ОблДАИР = ТабДок.Присоединить(ОблСтрокаДопАналитикаИР);
				
				ОблСтрокаДопАналитика.Параметры.ЗН_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоЗначение,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, "");
				//ОблДАЗН = ТабДок.Присоединить(ОблСтрокаДопАналитикаЗН);
				
				ОблСтрокаДопАналитика.Параметры.ВР_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоВидРасчета,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, "");
				//ОблДАВР = ТабДок.Присоединить(ОблСтрокаДопАналитикаВР);
				
				ОблСтрокаДопАналитика.Параметры.МЦ_СтруктураРасшифровки 	= Новый Структура("АналитикаСумм,ДопАналитика,ЭтоМинимальнаяЦена,ИндивидуальныйРасчет", ЭлСпА.Значение, ЭлСпДА.Значение, Истина, "");
				//Иначе
				//	ТабДок.Присоединить(ОблСтрокаДопАналитика);
			КонецЕсли;
			
			ОблДА = ТабДок.Присоединить(ОблСтрокаДопАналитика);
			
		КонецЦикла;
		
		Если РежимРедактированияЦен Тогда
			ОблСтрокаКонец = Макет.ПолучитьОбласть("СтрокаКонецМЦ");
		Иначе
			ОблСтрокаКонец = Макет.ПолучитьОбласть("СтрокаКонец");
		КонецЕсли;
		
		//ОблСтрокаКонец = Макет.ПолучитьОбласть("СтрокаКонец");
		ТабДок.Присоединить(ОблСтрокаКонец);
		
	КонецЦикла;
	
	ОблПодвалАналитика = Макет.ПолучитьОбласть("ПодвалАналитика");
	ТабДок.Вывести(ОблПодвалАналитика);
	
	Если РежимРедактированияЦен Тогда
		ОблПодвалДопАналитика = Макет.ПолучитьОбласть("ПодвалДопАналитика");
	Иначе
		ОблПодвалДопАналитика = Макет.ПолучитьОбласть("ПодвалДопАналитикаВывод");
	КонецЕсли;
	
	Для каждого ЭлСп Из СписокДопАналитик Цикл
		ТабДок.Присоединить(ОблПодвалДопАналитика);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.ТолькоПросмотр 	= Ложь;
	
	Возврат ТабДок;
	
КонецФункции

Функция СеткаКотрагентаДляСравнения(СтруктураПараметров, ДатаЦен=Неопределено) Экспорт
	
	пКонтрагент = СтруктураПараметров.Контрагент;
	пПринципал 	= ?(ТипЗнч(СтруктураПараметров.Принципал) = ТИП("СправочникСсылка.Принципал"), СтруктураПараметров.Принципал.ПринципалУстановкиЦен, СтруктураПараметров.Принципал);
	пУслуга		= СтруктураПараметров.УслугаОрганизации;
	пСпецЦены	= (СтруктураПараметров.Свойство("СпецЦены") И СтруктураПараметров.СпецЦены);
	
	пСтраныНачалаТранзита = Новый Массив;
	Если ТипЗнч(СтруктураПараметров.СтранаНачалаТранзита) = ТИП("СправочникСсылка.ГруппыСтран") Тогда
		
		пСтраныНачалаТранзита.Добавить(СтруктураПараметров.СтранаНачалаТранзита);
		
	ИначеЕсли ТипЗнч(СтруктураПараметров.СтранаНачалаТранзита) = ТИП("СправочникСсылка.СтранаОформления") И ЗначениеЗаполнено(СтруктураПараметров.СтранаНачалаТранзита) Тогда
		
		пСтраныНачалаТранзита.Добавить(СтруктураПараметров.СтранаНачалаТранзита);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГруппыСтранСтраныГруппы.Ссылка
		|ИЗ
		|	Справочник.ГруппыСтран.СтраныГруппы КАК ГруппыСтранСтраныГруппы
		|ГДЕ
		|	НЕ ГруппыСтранСтраныГруппы.Ссылка.ПометкаУдаления
		|	И ГруппыСтранСтраныГруппы.Страна = &Страна";
		
		Запрос.УстановитьПараметр("Страна", СтруктураПараметров.СтранаНачалаТранзита);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			пСтраныНачалаТранзита.Добавить(Выборка.Ссылка);
		Иначе
			пСтраныНачалаТранзита.Добавить(Справочники.ГруппыСтран.ПустаяСсылка());
		КонецЕсли;
		
	Иначе
		
		пСтраныНачалаТранзита.Добавить(Справочники.ГруппыСтран.ПустаяСсылка());
		
	КонецЕсли;
	
	пСтранаНачалаТранзита 	= Справочники.ГруппыСтран.ПустаяСсылка();
	пДатаЦен 				= Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныПоГруппам.КлючАналитик КАК КлючАналитик,
	|	ЦеныПоГруппам.Период КАК Период,
	|	ЦеныПоГруппам.ГруппаСтранНачалаТранзита
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ЦенообразованиеСеткаСрезПоследних.КлючАналитик КАК КлючАналитик,
	|		ЦенообразованиеСеткаСрезПоследних.Период КАК Период,
	|		ЦенообразованиеСеткаСрезПоследних.ГруппаСтранНачалаТранзита КАК ГруппаСтранНачалаТранзита,
	|		1 КАК Приоритет
	|	ИЗ
	|		РегистрСведений.ЦенообразованиеСетка.СрезПоследних(
	|				&Дата,
	|				Контрагент = &Контрагент
	|					И УслугаОрганизации = &УслугаОрганизации
	|					И Принципал = &Принципал
	|					И СпецЦены = &СпецЦены
	|					И ГруппаКодовУКТЗЕД = &ГруппаКодовУКТЗЕД
	|					И ГруппаСтранНачалаТранзита В (&ГруппаСтранНачалаТранзита)
	|					И ГруппаСтранНачалаТранзита ССЫЛКА Справочник.СтранаОформления) КАК ЦенообразованиеСеткаСрезПоследних
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ЦенообразованиеСеткаСрезПоследних.КлючАналитик,
	|		ЦенообразованиеСеткаСрезПоследних.Период,
	|		ЦенообразованиеСеткаСрезПоследних.ГруппаСтранНачалаТранзита,
	|		2
	|	ИЗ
	|		РегистрСведений.ЦенообразованиеСетка.СрезПоследних(
	|				&Дата,
	|				Контрагент = &Контрагент
	|					И УслугаОрганизации = &УслугаОрганизации
	|					И Принципал = &Принципал
	|					И СпецЦены = &СпецЦены
	|					И ГруппаКодовУКТЗЕД = &ГруппаКодовУКТЗЕД
	|					И ГруппаСтранНачалаТранзита В (&ГруппаСтранНачалаТранзита)
	|					И ГруппаСтранНачалаТранзита ССЫЛКА Справочник.ГруппыСтран) КАК ЦенообразованиеСеткаСрезПоследних
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Период УБЫВ,
	|		Приоритет) КАК ЦеныПоГруппам";
	
	Запрос.УстановитьПараметр("Дата"						, ДатаЦен);
	Запрос.УстановитьПараметр("Контрагент"					, пКонтрагент);
	Запрос.УстановитьПараметр("Принципал"					, пПринципал);
	Запрос.УстановитьПараметр("УслугаОрганизации"			, пУслуга);
	Запрос.УстановитьПараметр("ГруппаСтранНачалаТранзита"	, пСтраныНачалаТранзита);
	Запрос.УстановитьПараметр("ГруппаКодовУКТЗЕД"			, СтруктураПараметров.ГруппаКодовУКТЗЕД);
	Запрос.УстановитьПараметр("СпецЦены"					, пСпецЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		пКлюч 					= Выборка.КлючАналитик;
		пДатаЦен 				= Выборка.Период;
		пСтранаНачалаТранзита 	= Выборка.ГруппаСтранНачалаТранзита;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ГруппаСтранНачалаТранзита", пСтранаНачалаТранзита);
	СтруктураПараметров.Вставить("ПринципалУстановкиЦен"	, пПринципал);
	СтруктураПараметров.Вставить("ДатаЦен"					, пДатаЦен);
	СтруктураПараметров.Вставить("Ключ"						, пКлюч);
	ПолучитьСтруктуруКлюча(пКлюч, СтруктураПараметров);
	
	Возврат ПолучитьДанныеДляТаблицыКлюча(пКлюч, СтруктураПараметров);
	
КонецФункции
